# Scraping Data from a Website using BeautifulSoup & Pandas

In [39]:
import pandas as pd

In [1]:
from bs4 import BeautifulSoup
import requests

In [2]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

page = requests.get(url)

soup = BeautifulSoup(page.text, 'html')

In [71]:
# print(soup.prettify())

In [72]:
table = soup.find_all('table',class_='wikitable sortable')
large_comp= table[0]
profitable_comp = table[1]
# print(table)

In [33]:
large_comp_heading = large_comp.find_all('th')
large_comp_heading

[<th>Rank
 </th>,
 <th>Name
 </th>,
 <th>Industry
 </th>,
 <th>Revenue <br/>(USD millions)
 </th>,
 <th>Revenue growth
 </th>,
 <th>Employees
 </th>,
 <th>Headquarters
 </th>]

In [41]:
lc_table_heading = [head.text.strip() for head in large_comp_heading]
print(lc_table_heading)

['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth', 'Employees', 'Headquarters']

In [42]:
lc_df = pd.DataFrame(columns = lc_table_heading)
lc_df

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [73]:
lc_table_data = large_comp.find_all('tr')
# lc_table_data

In [50]:
for row in lc_table_data[1:]:
    row_data = row.find_all('td')
    individual_data = [data.text.strip() for data in row_data]
    
    length = len(lc_df)
    lc_df.loc[length] = individual_data

In [52]:
  lc_df.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,General merchandisers,"572,754",2.4%,"2,300,000","Bentonville, Arkansas"
1,2,Amazon,Retail and Cloud Computing,"469,822",21.7%,"1,608,000","Seattle, Washington"
2,3,Apple,Electronics industry,"365,817",33.2%,"154,000","Cupertino, California"
3,4,CVS Health,Healthcare,"292,111",32.0%,"258,000","Woonsocket, Rhode Island"
4,5,UnitedHealth Group,Healthcare,"287,597",11.8%,"350,000","Minnetonka, Minnesota"

In [66]:
lc_df.to_csv(r'D:\DataScience\Projects\Portfolio\DataScrapping\Top_US_Companies_By_Revenue\Outputs\LargeCompaniesUSA.csv', index = False)

In [54]:
profitable_comp_heading = profitable_comp.find_all('th')
profitable_comp_heading

[<th>Rank
 </th>,
 <th>Name
 </th>,
 <th>Industry
 </th>,
 <th>Profits<br/>(USD millions)
 </th>]

In [56]:
pc_table_heading = [head.text.strip() for head in profitable_comp_heading]
pc_table_heading

['Rank', 'Name', 'Industry', 'Profits(USD millions)']

In [57]:
pc_df = pd.DataFrame(columns = pc_table_heading)
pc_df

Empty DataFrame
Columns: [Rank, Name, Industry, Profits(USD millions)]
Index: []

In [74]:
pc_table_data = profitable_comp.find_all('tr')
# pc_table_data

In [62]:
for row in pc_table_data[1:]:
    row_data = row.find_all('td')
    individual_data = [data.text.strip() for data in row_data]
    
    length = len(pc_df)
    pc_df.loc[length] = individual_data

In [63]:
 pc_df.head()

  Rank                Name      Industry Profits(USD millions)
0    1               Apple   Electronics                94,680
1    2  Berkshire Hathaway  Conglomerate                89,795
2    3            Alphabet    Technology                76,033
3    4           Microsoft    Technology                72,271
4    5      JPMorgan Chase    Financials                48,334

In [65]:
pc_df.to_csv(r'D:\DataScience\Projects\Portfolio\DataScrapping\Top_US_Companies_By_Revenue\Outputs\Fortune500Companies.csv', index = False)